# FabricAreaOwnerId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..FabricAreaOwnerId Property
FabricSheet Class See Also
---
The Fabric Area Id.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId FabricAreaOwnerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricAreaOwnerId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ FabricAreaOwnerId {
	ElementId^ get ();
}
```

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace